#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Автозаполнить(Команда)
	АвтозаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура АвтозаполнитьНаСервере()
	
	МассивСотрудников = Новый Массив;
	Для Каждого Строка Из Объект.Выплаты Цикл
		МассивСотрудников.Добавить(Строка.Сотрудник);	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&МоментВремени,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
		|ГДЕ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0";
	
	Запрос.УстановитьПараметр("МоментВремени", Объект.Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = Объект.Выплаты.Добавить();
		Строка.Сотрудник = Выборка.Сотрудник;
		Строка.Сумма = Выборка.СуммаОстаток;				
	КонецЦикла;

КонецПроцедуры

#КонецОбласти