#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрошлыйМесяцНачало = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), -1));
	Период.ДатаНачала = ПрошлыйМесяцНачало;
	Период.ДатаОкончания = КонецМесяца(ПрошлыйМесяцНачало);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ДлительнаяОперация = ВыполнитьТяжелуюОперациюНаСервере(УникальныйИдентификатор, Период.ДатаНачала); 	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект); 

	Оповещение = Новый ОписаниеОповещения("ТяжелаяОперацияЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВыполнитьТяжелуюОперациюНаСервере(Форма, Период)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(Форма);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.ЗаполнитьТаблицу", Период);	

КонецФункции

&НаКлиенте
Процедура ТяжелаяОперацияЗавершение(Результат, ДополнительныеПараметры) Экспорт

	РезультатВХ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если РезультатВХ.Количество() > 0 Тогда
		Для Каждого Строка Из РезультатВХ Цикл
			НоваяСтрока = Список.Добавить();
			НоваяСтрока.Договор = Строка.Ключ;
			НоваяСтрока.Реализация = Строка.Значение;		
		КонецЦикла;
	Иначе
		СообщениеПользователю = Новый СообщениеПользователю();
		СообщениеПользователю.Текст = "В выбранном периоде нет действующих договоров, или же соответствующий документ реализации уже создан";
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти