
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере() 
	
	Данные = ПолучитьИзВременногоХранилища(Параметры.Данные);
	
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.Обновление = Ложь;
	
	Для Каждого Строка Из Данные Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку("ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск");
	
		Серия = ДиаграммаГанта.УстановитьСерию(Строка.Сотрудник);
		Серия.Значение = Строка.Сотрудник;
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;	
КонецПроцедуры

#КонецОбласти