
#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьТаблицу(Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора < &КонецМесяца
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора > &НачалоМесяца
		|	И НЕ ДоговорыКонтрагентов.Ссылка В
		|		(ВЫБРАТЬ
		|			РеализацияТоваровУслуг.Договор КАК Договор
		|		ИЗ
		|			Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ГДЕ
		|			РеализацияТоваровУслуг.Дата <= &КонецМесяца
		|			И РеализацияТоваровУслуг.Дата >= &НачалоМесяца)";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Период));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Список = Новый Соответствие();
	
	Пока Выборка.Следующий() Цикл
			
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Заполнить(Выборка.Ссылка);
		НовыйДокумент.Дата = Период;
		НовыйДокумент.ВыполнитьАвтозаполнение();	
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		НовыйДокумент.ПроверитьЗаполнение();
		
		Список.Вставить(Выборка.Ссылка, НовыйДокумент.Ссылка);	
			
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

#КонецОбласти
