#Область ОбработчикиСобытий

Процедура ОбработкаПроведения()
	
	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл	
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Очередность = Число(Строка(Год(Дата)) + Строка(Строка.НомерСтроки));
		Движение.ДатаНачала = Строка.ДатаНачала;
		Движение.ДатаОкончания = Строка.ДатаОкончания;
		Движение.Период = Дата;	
	КонецЦикла;	
	
	Движения.Записать();
	
КонецПроцедуры

#КонецОбласти