
 #Область ОбработчикиСобытийФормы
 
 // +++ Отображение реквизитов в зависимости от выбранного вида договора ПодвойскаяАВ 05.11.2023
 &НаСервере
 Процедура ПриСозданииНаСервере()
 	ОбновитьВидимостьЭлементов();
 КонецПроцедуры
 // --- ПодвойскаяАВ 05.11.2023
 
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// +++ Отображение реквизитов в зависимости от выбранного вида договора ПодвойскаяАВ 05.11.2023
&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();	
КонецПроцедуры
// --- ПодвойскаяАВ 05.11.2023

 #КонецОбласти
 
 
 #Область СлужебныеПроцедурыИФункции 
 
 // +++ Отображение реквизитов в зависимости от выбранного вида договора ПодвойскаяАВ 05.11.2023
 &НаСервере
 Процедура ОбновитьВидимостьЭлементов()
 	Если ЗначениеЗаполнено(Объект.ВидДоговора) Тогда
		Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			Элементы.АбонентскаяПлата.Видимость = Истина;
		Иначе
			Элементы.АбонентскаяПлата.Видимость = Ложь;
		КонецЕсли;
	Иначе
			Элементы.АбонентскаяПлата.Видимость = Ложь;
	КонецЕсли;	
 КонецПроцедуры 
// --- ПодвойскаяАВ 05.11.2023

 #КонецОбласти